src/Catalogs/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>БонусныеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыБонусныхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецБонусногоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Именной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеНачислятьПриОплатеБонусами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОграниченПроцентомСписания</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеНачисленийПоСрокуДействия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОграниченийСрокаДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеСписанияПроцент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействияНачисленийТип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНачисленияВДеньРождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКлиента</Name>
					<Comment>Ключ для оплаты SKLLZZ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Удалить_ПакетУслугСоставУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УслугаСегмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/AccumulationRegisters/БонусныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>БонусныеСчета</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>БонусныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БонусныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументНачисления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Реализация</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводНачальныхОстатков</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияПоБонусномуСчету</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Enums/ТипыОграниченийСрокаДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыОграниченийСрокаДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бессрочный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокДействия_С_По</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокОграниченПериодом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресТолькоРоссийский</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьВводНекорректного</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногострочноеПоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонCДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/БонусныеСчета/Ext/ManagerModule.bsl
#область ОбработчикиСобытий

// Процедура - Обработка получения представления
//
// Параметры:
//  Данные				 - 	 - 
//  Представление		 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СформироватьНаименование(Данные.Код, Данные.ВидБонусногоСчета, Данные.ВладелецБонусногоСчета);
	
КонецПроцедуры

// Процедура - Обработка получения полей представления
//
// Параметры:
//  Поля				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("Код");
    Поля.Добавить("Ссылка");	
    Поля.Добавить("ПометкаУдаления");	
	Поля.Добавить("ВидБонусногоСчета");
	Поля.Добавить("ВладелецБонусногоСчета");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура, заполняет срок действия БС.
//
Процедура ЗаполнитьСрокДействияБонусногоСчета(Знач ВидБонусногоСчета, Знач ДатаОткрытия, СрокДействияНачало, СрокДействияКонец) Экспорт
	
	Если ЗначениеЗаполнено(ВидБонусногоСчета) Тогда 
		Если ВидБонусногоСчета.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокДействия_С_По Тогда 
			СрокДействияНачало 	= ВидБонусногоСчета.СрокДействияДатойС;
			СрокДействияКонец 	= ВидБонусногоСчета.СрокДействияДатойПо;			
		ИначеЕсли ВидБонусногоСчета.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.СрокОграниченПериодом Тогда 
			СрокДействияНачало 	= НачалоДня(?(ДатаОткрытия = Дата(1,1,1), ТекущаяДата(), ДатаОткрытия));
			Если ЗначениеЗаполнено(ВидБонусногоСчета.СрокДействияТип) Тогда
				Если ВидБонусногоСчета.СрокДействияТип = Перечисления.Периодичность.День Тогда 
					СрокДействияКонец = КонецДня(СрокДействияНачало + ВидБонусногоСчета.СрокДействия * (60*60*24));
				ИначеЕсли ВидБонусногоСчета.СрокДействияТип = Перечисления.Периодичность.Месяц Тогда	
					СрокДействияКонец = КонецДня(ДобавитьМесяц(СрокДействияНачало, ВидБонусногоСчета.СрокДействия));
				ИначеЕсли ВидБонусногоСчета.СрокДействияТип = Перечисления.Периодичность.Год Тогда	
					СрокДействияКонец = КонецДня(ДобавитьМесяц(СрокДействияНачало, ВидБонусногоСчета.СрокДействия * 12));
				КонецЕсли;	
			Иначе 
				СрокДействияКонец 	= Дата(1,1,1);
			КонецЕсли;			
		ИначеЕсли ВидБонусногоСчета.ОграничениеПоСрокуДействия = Перечисления.ТипыОграниченийСрокаДействия.Бессрочный Тогда 
			СрокДействияНачало 	= Дата(1,1,1);
			СрокДействияКонец 	= Дата(1,1,1);		
		КонецЕсли;
	Иначе 	
		СрокДействияНачало 	= Дата(1,1,1);
		СрокДействияКонец 	= Дата(1,1,1);				
	КонецЕсли;
	
КонецПроцедуры

// Процедура, заполняет наименование ЛС.
//
Функция СформироватьНаименование(Знач Код, Знач ВидБонусногоСчета, Знач ВладелецБонусногоСчета) Экспорт
	
	Наименование = ?(ЗначениеЗаполнено(Код), ФормированиеПечатныхФорм.ПолучитьНомерНаПечать(СокрЛП(Код), ""), "<Код>") + ", "    // код
				+ ?(ЗначениеЗаполнено(ВидБонусногоСчета), ВидБонусногоСчета, "<Вид счета>") + ", "  //вид счета
				+ ?(ТипЗнч(ВладелецБонусногоСчета) = Тип("СправочникСсылка.Контрагенты"), ?(ЗначениеЗаполнено(ВладелецБонусногоСчета), ВладелецБонусногоСчета, "<Клиент>"), ?(ЗначениеЗаполнено(ВладелецБонусногоСчета), "Карта №" + ВладелецБонусногоСчета.КодКарты, "<Карта>"));	
				
				
	Возврат Наименование;
	
КонецФункции

// Функция возвращает лицевой счет контрагента
//
Функция ВернутьБонусныеСчетаВладельца(ВладелецБонусногоСчета, Дата, ВидБонусногоСчета = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(ВладелецБонусногоСчета) Тогда 
		
		Запрос = Новый Запрос;
		Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		               |	БонусныеСчета.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.БонусныеСчета КАК БонусныеСчета
		               |ГДЕ
		               |	БонусныеСчета.ВладелецБонусногоСчета = &Владелец
		               |	И ВЫБОР
		               |			КОГДА БонусныеСчета.СрокДействияНачало <> ДАТАВРЕМЯ(1, 1, 1)
		               |					И БонусныеСчета.СрокДействияКонец <> ДАТАВРЕМЯ(1, 1, 1)
		               |				ТОГДА БонусныеСчета.СрокДействияНачало <= &ТекущаяДата
		               |						И БонусныеСчета.СрокДействияКонец >= &ТекущаяДата
		               |			ИНАЧЕ ИСТИНА
		               |		КОНЕЦ
		               |	И НЕ БонусныеСчета.ПометкаУдаления
					   |    И &УсловиеПоВидуБонусногоСчета";
					   
		Запрос.УстановитьПараметр("Владелец"   , ВладелецБонусногоСчета);
		Запрос.УстановитьПараметр("ТекущаяДата", ?(Дата = Дата(1,1,1), ТекущаяДатаСеанса(), Дата));
		
		Если ВидБонусногоСчета = Неопределено Тогда
			
			Текст = СтрЗаменить(Текст, "И &УсловиеПоВидуБонусногоСчета", "");
			
		Иначе
			
			Текст = СтрЗаменить(Текст, "И &УсловиеПоВидуБонусногоСчета", " И БонусныеСчета.ВидБонусногоСчета = &ВидБонусногоСчета");
            Запрос.УстановитьПараметр("ВидБонусногоСчета", ВидБонусногоСчета);
			
		КонецЕсли;
		
		Запрос.Текст = Текст;

		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	Иначе 
		
		Возврат Новый Массив;
		
	КонецЕсли;
	 	
КонецФункции

// Функция - Получить представление лицевого счета
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьПредставлениеБонусногоСчета(БонусныййСчет) Экспорт
	
	ПредставлениеТелефон = БонусныййСчет.ТелефонКлиента; 
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		Если ЗначениеЗаполнено(ПредставлениеТелефон) Тогда
			ПредставлениеТелефон = " " + УправлениеКонтактнойИнформациейСлужебныйСтоматология.КонтактнаяИнформацияXDTOПоПредставлению(ПредставлениеТелефон, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента).Представление;	
		КонецЕсли;
	#КонецЕсли
	Возврат Строка(БонусныййСчет.ВидБонусногоСчета) + ПредставлениеТелефон + ?(ЗначениеЗаполнено(БонусныййСчет.СрокДействияКонец), " до " + Формат(БонусныййСчет.СрокДействияКонец, "ДЛФ=D"), "");

КонецФункции

// Функция - Получить историю лицевого счета
//
// Параметры:
//  ЛицевойСчет	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ИсторияБонусногоСчета(БонусныйСчет, ГруппировкаПоДокументуНачисления = Истина) Экспорт
	
	Если ГруппировкаПоДокументуНачисления Тогда 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеСчетаОбороты.ДокументНачисления КАК ДокументНачисления,
		|	БонусныеСчетаОбороты.Регистратор КАК Регистратор,
		|	БонусныеСчетаОбороты.Период КАК Период,
		|	БонусныеСчетаОбороты.СуммаОборот КАК Сумма,
		|	ВЫБОР
		|		КОГДА БонусныеСчетаОбороты.СуммаОборот > 0
		|			ТОГДА &ПредставлениеНачисление
		|		ИНАЧЕ &ПредставлениеСписание
		|	КОНЕЦ КАК Операция,
		|	БонусныеСчетаОбороты.СуммаПриход КАК СуммаНачисления
		|ИЗ
		|	РегистрНакопления.БонусныеСчета.Обороты(, , Регистратор, БонусныйСчет = &БонусныйСчет) КАК БонусныеСчетаОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаНачисления)
		|ПО
		|	ДокументНачисления");   
	Иначе 
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	БонусныеСчетаОбороты.Регистратор КАК Регистратор,
		|	БонусныеСчетаОбороты.Период КАК Период,
		|	БонусныеСчетаОбороты.СуммаОборот КАК Сумма,
		|	ВЫБОР
		|		КОГДА БонусныеСчетаОбороты.СуммаОборот > 0
		|			ТОГДА &ПредставлениеНачисление
		|		ИНАЧЕ &ПредставлениеСписание
		|	КОНЕЦ КАК Операция,
		|	БонусныеСчетаОбороты.СуммаПриход КАК СуммаНачисления
		|ИЗ
		|	РегистрНакопления.БонусныеСчета.Обороты(, , Регистратор, БонусныйСчет = &БонусныйСчет) КАК БонусныеСчетаОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период");   
	КонецЕсли;
	
	Запрос.УстановитьПараметр("БонусныйСчет"           ,БонусныйСчет); 
	Запрос.УстановитьПараметр("ПредставлениеНачисление",НСтр("ru= 'Начисление';en= 'Accrual'")); 
	Запрос.УстановитьПараметр("ПредставлениеСписание"  ,НСтр("ru= 'Списание';en= 'Debt'")); 
		
	Возврат Запрос.Выполнить();
	
КонецФункции

// Функция - Создать бонусный счет владельца
//
// Параметры:
//  КонтрагентКарта		 - 	 - 
//  ВидБонусногоСчета	 - 	 - 
//  Дата				 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция СоздатьБонусныйСчетВладельца(Контрагент, Карта, ВидБонусногоСчета, Дата) Экспорт
	
   БонусныйСчетОбъект                        = Справочники.БонусныеСчета.СоздатьЭлемент();
   БонусныйСчетОбъект.Именной                = ЗначениеЗаполнено(Контрагент);
   БонусныйСчетОбъект.ВидБонусногоСчета      = ВидБонусногоСчета;
   БонусныйСчетОбъект.ВладелецБонусногоСчета = ?(ЗначениеЗаполнено(Контрагент), Контрагент, Карта);
   БонусныйСчетОбъект.Наименование           = СформироватьНаименование(БонусныйСчетОбъект.Код, БонусныйСчетОбъект.Именной, БонусныйСчетОбъект.ВладелецБонусногоСчета);
   БонусныйСчетОбъект.ДатаОткрытия           = Дата; 
   БонусныйСчетОбъект.Записать();
   
   Возврат БонусныйСчетОбъект.Ссылка;
   
КонецФункции

#КонецОбласти
